app/views/questions/index.html.erb

SELECT "comments".* FROM "comments" WHERE ("comments".question_id = 2) LIMIT 1
---
	</tr>
<% if question.comments.first %>

SELECT "questions".* FROM "questions" WHERE ("questions".user_id = 1)
---

<% current_user.questions.each do |question| %>