app/views/questions/show.html.erb

SELECT "votes"."id" FROM "votes" WHERE ("votes".answer_id = 68) AND (votes.user_id = 7) LIMIT 1
SELECT COUNT(*) FROM "votes" WHERE ("votes".answer_id = 14)
---
            <td>
              <%= answer.votes.count %>