app/controllers/answers_controller.rb

  def index
    @answers = Answer.all
---
SELECT "answers".* FROM "answers"

  def show
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE ("answers"."id" = 2) LIMIT 1

  def create

		params[:answer][:user_id]=current_user.id
    @answer = Answer.new(params[:answer])

    respond_to do |format|
      if @answer.save
---
INSERT INTO "answers" ("question_id", "user_id", "answer", "created_at", "updated_at") VALUES (NULL, 1, 'test', '2011-03-30 20:41:20.534497', '2011-03-30 20:41:20.534497')