app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE ("comments"."id" = 3) LIMIT 1
---
  def show
    @comment = Comment.find(params[:id])

SELECT "comments".* FROM "comments" WHERE ("comments"."id" = 4) LIMIT 1
---
  def edit
    @comment = Comment.find(params[:id])

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 2) LIMIT 1
INSERT INTO "comments" ("question_id", "user_id", "text", "is_public", "created_at", "updated_at") VALUES (1, 2, 'testje', NULL, '2011-04-01 22:14:37.971060', '2011-04-01 22:14:37.971060')
---
  def create
		params[:comment][:user_id]=current_user.id

		@question = Question.find(params[:question_id])
		@comment = @question.comments.create(params[:comment])

SELECT "comments".* FROM "comments" WHERE ("comments"."id" = 4) LIMIT 1
UPDATE "comments" SET "comment" = 'bla!!', "updated_at" = '2011-03-26 16:21:50.798109' WHERE ("comments"."id" = 4)
---
  def update
    @comment = Comment.find(params[:id])
		authorize! :update, @comment

    respond_to do |format|
      if @comment.update_attributes(params[:comment])

SELECT "comments".* FROM "comments" WHERE ("comments"."id" = 5) LIMIT 1
DELETE FROM "comments" WHERE ("comments"."id" = 7)
---
  def destroy
    @comment = Comment.find(params[:id])
		authorize! :destroy, @comment
    @comment.destroy