app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT "images".* FROM "images"

  def show
    @image = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE ("images"."id" = 3) LIMIT 1

  def edit
    @image = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE ("images"."id" = 4) LIMIT 1

  def create
    @image = Image.new(params[:image])

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("description", "question_id", "image_file_name", "image_file_size", "image_content_type", "created_at", "updated_at") VALUES (NULL, NULL, NULL, NULL, NULL, '2011-04-17 11:56:01.362156', '2011-04-17 11:56:01.362156')