app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE ("questions".user_id = 1)
---
  def index
    @questions = Question.all

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 1) LIMIT 1
---
  def show
    @question = Question.find(params[:id])

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 1) LIMIT 1
---
  def edit
		@question = Question.find(params[:id])

INSERT INTO "questions" ("user_id", "subject", "body", "image_location", "created_at", "updated_at") VALUES (NULL, 'test', 'even kijken of dit werkt', 'locatie van afbeelding', '2011-03-25 20:14:55.953100', '2011-03-25 20:14:55.953100')
---
  def create

  #here the user_id is inserted in every answer
  #the question_id is inserted via the nested attributes
	params[:question][:answers_attributes].keys.each {|key| params[:question][:answers_attributes][key][:user_id] = current_user.id }




  #here the question_id and the user_id is inserted in every question
  params[:question][:user_id]=current_user.id

    @question = Question.new(params[:question])

		#@question.user = current_user

    respond_to do |format|
      if @question.save

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 6) LIMIT 1
---
  def update

#here the user_id is inserted in every answer
  #the question_id is inserted via the nested attributes
	params[:question][:answers_attributes].keys.each {|key| params[:question][:answers_attributes][key][:user_id] = current_user.id }


  #here the question_id and the user_id is inserted in every question
  params[:question][:user_id]=current_user.id

    @question = Question.find(params[:id])

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 1) LIMIT 1
DELETE FROM "questions" WHERE ("questions"."id" = 1)
---
  def destroy
    @question = Question.find(params[:id])
		authorize! :destroy, @question
    @question.destroy