app/controllers/uploads_controller.rb

  def index
    @uploads = Upload.all
---
SELECT "uploads".* FROM "uploads"

  def show
    @upload = Upload.find(params[:id])
---
SELECT "uploads".* FROM "uploads" WHERE ("uploads"."id" = 3) LIMIT 1

  def edit
    @upload = Upload.find(params[:id])
---
SELECT "uploads".* FROM "uploads" WHERE ("uploads"."id" = 3) LIMIT 1

  def create
    #params[:upload][:question_id]=@question.id
    @upload = Upload.new(params[:upload])

    respond_to do |format|
      if @upload.save
---
INSERT INTO "uploads" ("description", "question_id", "photo_file_name", "photo_file_size", "photo_content_type", "created_at", "updated_at") VALUES ('', NULL, NULL, NULL, NULL, '2011-04-07 12:36:38.459513', '2011-04-07 12:36:38.459513')

  def update
    @upload = Upload.find(params[:id])
---
SELECT "uploads".* FROM "uploads" WHERE ("uploads"."id" = 3) LIMIT 1

  def destroy
    @upload = Upload.find(params[:id])
    @upload.destroy
---
SELECT "uploads".* FROM "uploads" WHERE ("uploads"."id" = 22) LIMIT 1
DELETE FROM "uploads" WHERE ("uploads"."id" = 22)