app/controllers/votes_controller.rb

SELECT "votes".* FROM "votes"
---
  def index
    @votes = Vote.all

SELECT "votes".* FROM "votes" WHERE ("votes"."id" = 1) LIMIT 1
---
  def show
    @vote = Vote.find(params[:id])

INSERT INTO "answers" ("question_id", "user_id", "text", "created_at", "updated_at") VALUES (1, NULL, 'nieuw answer', '2011-04-01 21:34:46.190284', '2011-04-01 21:34:46.190284')
INSERT INTO "votes" ("answer_id", "user_id", "created_at", "updated_at") VALUES (1, 2, '2011-04-01 21:05:45.778493', '2011-04-01 21:05:45.778493')
---
  def create
    if params[:answer]
      @answer = Answer.new(params[:answer])
      @answer.save
# TODO: error handling
      params[:vote] = {:answer_id => @answer.id}
    end

    params[:vote][:user_id] = current_user.id
    @vote = Vote.new(params[:vote])



    respond_to do |format|
      if @vote.save